In [2]:
import pandas as pd
import numpy as np 
import matplotlib.pyplot as plt 
import seaborn as sns

from warnings import filterwarnings
filterwarnings('ignore')

In [29]:
df = pd.read_csv(r'E:\Python\EDA\Diwali_Sales_Analysis\Diwali.csv', encoding = 'unicode_escape')

In [30]:
df.head()

,User_ID,Cust_name,Product_ID,Gender,Age Group,Age,Marital_Status,State,Zone,Occupation,Product_Category,Orders,Amount,Status,unnamed1
0,1002903,Sanskriti,P00125942,F,26-35,28,0,Maharashtra,Western,Healthcare,Auto,1,23952.0,NaN,NaN
1,1000732,Kartik,P00110942,F,26-35,35,1,Andhra Pradesh,Southern,Govt,Auto,3,23934.0,NaN,NaN
2,1001990,Bindu,P00118542,F,26-35,35,1,Uttar Pradesh,Central,Automobile,Auto,3,23924.0,NaN,NaN
3,1001425,Sudevi,P00237842,M,0-17,16,0,Karnataka,Southern,Construction,Auto,2,23912.0,NaN,NaN
4,1000588,Joni,P00057942,M,26-35,28,1,Gujarat,Western,Food Processing,Auto,2,23877.0,NaN,NaN

In [7]:
df.tail()

,User_ID,Cust_name,Product_ID,Gender,Age Group,Age,Marital_Status,State,Zone,Occupation,Product_Category,Orders,Amount,Status,unnamed1
11246,1000695,Manning,P00296942,M,18-25,19,1,Maharashtra,Western,Chemical,Office,4,370.0,NaN,NaN
11247,1004089,Reichenbach,P00171342,M,26-35,33,0,Haryana,Northern,Healthcare,Veterinary,3,367.0,NaN,NaN
11248,1001209,Oshin,P00201342,F,36-45,40,0,Madhya Pradesh,Central,Textile,Office,4,213.0,NaN,NaN
11249,1004023,Noonan,P00059442,M,36-45,37,0,Karnataka,Southern,Agriculture,Office,3,206.0,NaN,NaN
11250,1002744,Brumley,P00281742,F,18-25,19,0,Maharashtra,Western,Healthcare,Office,3,188.0,NaN,NaN

In [8]:
df.shape

(11251, 15)

In [9]:
df.columns

Index(['User_ID', 'Cust_name', 'Product_ID', 'Gender', 'Age Group', 'Age',
       'Marital_Status', 'State', 'Zone', 'Occupation', 'Product_Category',
       'Orders', 'Amount', 'Status', 'unnamed1'],
      dtype='object')

In [10]:
df.dtypes

User_ID               int64
Cust_name            object
Product_ID           object
Gender               object
Age Group            object
Age                   int64
Marital_Status        int64
State                object
Zone                 object
Occupation           object
Product_Category     object
Orders                int64
Amount              float64
Status              float64
unnamed1            float64
dtype: object

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11251 entries, 0 to 11250
Data columns (total 15 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   User_ID           11251 non-null  int64
 1   Cust_name         11251 non-null  object
 2   Product_ID        11251 non-null  object
 3   Gender            11251 non-null  object
 4   Age Group         11251 non-null  object
 5   Age               11251 non-null  int64
 6   Marital_Status    11251 non-null  int64
 7   State             11251 non-null  object
 8   Zone              11251 non-null  object
 9   Occupation        11251 non-null  object
 10  Product_Category  11251 non-null  object
 11  Orders            11251 non-null  int64
 12  Amount            11239 non-null  float64
 13  Status            0 non-null      float64
 14  unnamed1          0 non-null      float64
dtypes: float64(3), int64(4), object(8)
memory usage: 1.3+ MB

In [17]:
df.isna().sum()

Cust_name           0
Product_ID          0
Gender              0
Age Group           0
Age                 0
Marital_Status      0
State               0
Zone                0
Occupation          0
Product_Category    0
Orders              0
Amount              0
dtype: int64

In [19]:
df.duplicated().sum()

np.int64(0)

In [14]:
df.drop(['User_ID','Status', 'unnamed1'], axis = 1, inplace = True)

In [15]:
df.head()

,Cust_name,Product_ID,Gender,Age Group,Age,Marital_Status,State,Zone,Occupation,Product_Category,Orders,Amount
0,Sanskriti,P00125942,F,26-35,28,0,Maharashtra,Western,Healthcare,Auto,1,23952.0
1,Kartik,P00110942,F,26-35,35,1,Andhra Pradesh,Southern,Govt,Auto,3,23934.0
2,Bindu,P00118542,F,26-35,35,1,Uttar Pradesh,Central,Automobile,Auto,3,23924.0
3,Sudevi,P00237842,M,0-17,16,0,Karnataka,Southern,Construction,Auto,2,23912.0
4,Joni,P00057942,M,26-35,28,1,Gujarat,Western,Food Processing,Auto,2,23877.0

In [16]:
df['Amount'].fillna(df['Amount'].mean(), inplace = True)

In [18]:
df.drop_duplicates(inplace=True)

In [23]:
df['Age Group'].replace({'0-17': 'Young', '18-25' : 'Adult', '26-35': 'Adult', '36-45':'Middle_Age', '46-50': 'Middle_Age', '51-55':'Middle_Age', '55+': 'Senior'}, inplace=True)

In [25]:
df['Age Group'].unique()

array(['Adult', 'Young', 'Senior', 'Middle_Age'], dtype=object)

In [26]:
df.describe(include=['object']).T

                  count unique                 top  freq
Cust_name         11243   1250            Vishakha    42
Product_ID        11243   2351           P00265242    53
Gender            11243      2                   F  7838
Age Group         11243      4               Adult  6416
State             11243     16       Uttar Pradesh  1944
Zone              11243      5             Central  4294
Occupation        11243     15           IT Sector  1586
Product_Category  11243     18  Clothing & Apparel  2653

In [27]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
Age,11243.0,35.422841,12.756369,12.0,27.0,33.0,43.0,92.0
Marital_Status,11243.0,0.420261,0.493623,0.0,0.0,0.0,1.0,1.0
Orders,11243.0,2.488749,1.114960,1.0,1.0,2.0,3.0,4.0
Amount,11243.0,9454.084476,5218.941128,188.0,5444.0,8111.0,12672.0,23952.0

In [28]:
cat_col = df.select_dtypes(include = 'object').columns
num_col = df.select_dtypes(include=np.number).columns.tolist()
print(num_col)
print(cat_col)

['Age', 'Marital_Status', 'Orders', 'Amount']
Index(['Cust_name', 'Product_ID', 'Gender', 'Age Group', 'State', 'Zone',
       'Occupation', 'Product_Category'],
      dtype='object')